In [53]:
import numpy as np
import pandas as pd

In [54]:
data = pd.read_csv('data/2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv', index_col='order_id')

In [55]:
data.tail(25)

,shop_id,user_id,order_amount,total_items,payment_method,created_at
order_id,,,,,,
4976,76,932,155,1,cash,2017-03-25 1:15:09
4977,93,763,114,1,credit_card,2017-03-20 17:14:51
4978,69,903,131,1,credit_card,2017-03-13 10:39:49
4979,2,841,282,3,cash,2017-03-09 19:13:23
4980,75,820,128,1,debit,2017-03-25 12:28:18
4981,50,942,772,4,credit_card,2017-03-23 5:15:19
4982,86,715,260,2,debit,2017-03-10 18:53:38
4983,1,906,316,2,credit_card,2017-03-26 15:57:18
4984,46,969,332,2,cash,2017-03-23 19:18:15
4985,44,966,432,3,credit_card,2017-03-15 20:12:31
4986,8,916,396,3,debit,2017-03-15 14:22:51
4987,100,731,111,1,cash,2017-03-30 7:01:59
4988,11,826,184,1,credit_card,2017-03-02 9:35:25
4989,86,877,260,2,cash,2017-03-12 19:55:36
4990,11,843,552,3,credit_card,2017-03-02 15:06:29
4991,24,860,140,1,cash,2017-03-26 0:32:39
4992,61,707,158,1,cash,2017-03-13 18:56:04
4993,49,739,258,2,debit,2017-03-24 13:48:08
4994,4,834,384,3,debit,2017-03-18 4:12:20
4995,12,954,201,1,cash,2017-03-22 0:38:11
4996,73,993,330,2,debit,2017-03-30 13:47:17
4997,48,789,234,2,cash,2017-03-16 20:36:16
4998,56,867,351,3,cash,2017-03-19 5:42:42
4999,60,825,354,2,credit_card,2017-03-16 14:51:18
5000,44,734,288,2,debit,2017-03-18 15:48:18

In [56]:
data.groupby('shop_id')['user_id'].count()

shop_id
1      44
2      55
3      48
4      51
5      45
       ..
96     51
97     48
98     58
99     54
100    40
Name: user_id, Length: 100, dtype: int64

In [57]:
len(data)

5000

In [58]:
data['order_amount'].sum()/ 5000

3145.128

The average number of orders in the store is 50

In [59]:
data.groupby('shop_id')['order_amount'].sum()

shop_id
1      13588
2       9588
3      14652
4      13184
5      13064
       ...
96     16830
97     15552
98     14231
99     18330
100     8547
Name: order_amount, Length: 100, dtype: int64

In [60]:
#Daily order value per shop over a 30-day window
data['created_at'] = pd.to_datetime(data['created_at'])
data.groupby([pd.Grouper(key='created_at', freq='D'), 'shop_id']).order_amount.sum().head(200)

created_at  shop_id
2017-03-01  1          158
            2           94
            3          740
            5          568
            6          748
                      ...
2017-03-03  31         645
            32         606
            34         366
            35         820
            36         910
Name: order_amount, Length: 200, dtype: int64

In [61]:
#group by day
#check if the data is ordered by a 30 day period
data.resample('D', on='created_at').order_amount.sum()

created_at
2017-03-01     106154
2017-03-02    1588109
2017-03-03      48729
2017-03-04     855504
2017-03-05     126293
2017-03-06      42266
2017-03-07    1465850
2017-03-08      43432
2017-03-09     191287
2017-03-10      48908
2017-03-11     781305
2017-03-12     856797
2017-03-13      51362
2017-03-14     122336
2017-03-15     795442
2017-03-16     350442
2017-03-17     915709
2017-03-18     259864
2017-03-19     773732
2017-03-20      98665
2017-03-21     101563
2017-03-22     857995
2017-03-23      50003
2017-03-24    1456430
2017-03-25     857247
2017-03-26     207534
2017-03-27     334819
2017-03-28    2165019
2017-03-29      98929
2017-03-30      73915
Freq: D, Name: order_amount, dtype: int64

In [62]:
new_df = data.groupby("shop_id").mean()

In [63]:
new_df.head()

            user_id  order_amount  total_items
shop_id
1        833.613636    308.818182     1.954545
2        861.272727    174.327273     1.854545
3        847.708333    305.250000     2.062500
4        866.450980    258.509804     2.019608
5        862.222222    290.311111     2.044444

In [64]:
new_df.mean(axis = 0)

user_id          849.271423
order_amount    3136.834088
total_items        8.652863
dtype: float64

In [65]:
data.head()

,shop_id,user_id,order_amount,total_items,payment_method,created_at
order_id,,,,,,
1,53,746,224,2,cash,2017-03-13 12:36:56
2,92,925,90,1,cash,2017-03-03 17:38:52
3,44,861,144,1,cash,2017-03-14 04:23:56
4,18,935,156,1,credit_card,2017-03-26 12:43:37
5,18,883,156,1,credit_card,2017-03-01 04:35:11

In [66]:
data.mean(axis= 0)

/var/folders/xg/x9dp1h1x32q36fc2kpxyxd180000gn/T/ipykernel_28750/4034443637.py:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  data.mean(axis= 0)
/var/folders/xg/x9dp1h1x32q36fc2kpxyxd180000gn/T/ipykernel_28750/4034443637.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean(axis= 0)

shop_id           50.0788
user_id          849.0924
order_amount    3145.1280
total_items        8.7872
dtype: float64

### Average per unit order value

In [67]:
data["unit_order_amount"] = data["order_amount"]/data["total_items"]

In [68]:
data.head()

,shop_id,user_id,order_amount,total_items,payment_method,created_at,unit_order_amount
order_id,,,,,,,
1,53,746,224,2,cash,2017-03-13 12:36:56,112.0
2,92,925,90,1,cash,2017-03-03 17:38:52,90.0
3,44,861,144,1,cash,2017-03-14 04:23:56,144.0
4,18,935,156,1,credit_card,2017-03-26 12:43:37,156.0
5,18,883,156,1,credit_card,2017-03-01 04:35:11,156.0

In [69]:
data.mean()

/var/folders/xg/x9dp1h1x32q36fc2kpxyxd180000gn/T/ipykernel_28750/531903386.py:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  data.mean()
/var/folders/xg/x9dp1h1x32q36fc2kpxyxd180000gn/T/ipykernel_28750/531903386.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean()

shop_id                50.0788
user_id               849.0924
order_amount         3145.1280
total_items             8.7872
unit_order_amount     387.7428
dtype: float64

### Answers

a.

b.

c.